<details>
<summary>Execution result of "run-all plan" in "stacks/prod"</summary>

```terraform
time=2024-12-12T13:50:30Z level=info msg=The stack at /github/workspace/stacks/prod will be processed in the following order for command plan:
Group 1
- Module /github/workspace/stacks/prod/hetzner

Group 2
- Module /github/workspace/stacks/prod/kubernetes


time=2024-12-12T13:50:31Z level=info msg=Downloading Terraform configurations from file:///github/workspace/modules/hetzner into /github/workspace/stacks/prod/hetzner/.terragrunt-cache/7n5v_ZVOv4gLIvn-SLBHuU7F7OI/B-HSI5LUu0nLTnyopQYP4SLEkoU prefix=[/github/workspace/stacks/prod/hetzner] 
Initializing the backend...

Successfully configured the backend "remote"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
Downloading git::https://github.com/mrsimonemms/terraform-module-k3s.git for k3s...
- k3s in .terraform/modules/k3s
Initializing provider plugins...
- Reusing previous version of loafoe/ssh from the dependency lock file
- Reusing previous version of hetznercloud/hcloud from the dependency lock file
- Reusing previous version of hashicorp/local from the dependency lock file
- Installing loafoe/ssh v2.7.0...
- Installed loafoe/ssh v2.7.0 (self-signed, key ID C0E4EB79E9E6A23D)
- Installing hetznercloud/hcloud v1.48.0...
- Installed hetznercloud/hcloud v1.48.0 (signed by a HashiCorp partner, key ID 5219EACB3A77198B)
- Installing hashicorp/local v2.5.1...
- Installed hashicorp/local v2.5.1 (signed by HashiCorp)
Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has been successfully initialized!
hcloud_network.network: Refreshing state... [id=10444900]
hcloud_placement_group.managers[0]: Refreshing state... [id=434917]
hcloud_ssh_key.server: Refreshing state... [id=25427482]
hcloud_load_balancer.k3s_manager[0]: Refreshing state... [id=2213329]
hcloud_network_subnet.subnet: Refreshing state... [id=10444900-10.0.0.0/16]
hcloud_firewall.firewall: Refreshing state... [id=1788921]
hcloud_load_balancer_network.k3s_manager[0]: Refreshing state... [id=2213329-10444900]
hcloud_load_balancer_service.k3s_manager[0]: Refreshing state... [id=2213329__6443]
hcloud_load_balancer_target.k3s_manager[0]: Refreshing state... [id=lb-label-selector-tgt-f13103f1b53f748a64e813b07b8a0a70830ba59574b0885e6b5f98eac68e9d58-2213329]
hcloud_server.manager[2]: Refreshing state... [id=57444127]
hcloud_server.manager[0]: Refreshing state... [id=57444125]
hcloud_server.manager[1]: Refreshing state... [id=57444126]
ssh_resource.manager_ready[2]: Refreshing state... [id=5441587311187008154]
ssh_resource.manager_ready[0]: Refreshing state... [id=2718101182745174571]
ssh_resource.manager_ready[1]: Refreshing state... [id=2801026208270560270]
module.k3s.ssh_resource.initial_manager: Refreshing state... [id=3335545254769677009]
module.k3s.ssh_sensitive_resource.join_token: Refreshing state... [id=6554613666349604783]
module.k3s.ssh_sensitive_resource.kubeconfig: Refreshing state... [id=2036497781828774256]
module.k3s.ssh_resource.additional_managers["prod-k3s-manager-1"]: Refreshing state... [id=2843396665515506814]
module.k3s.ssh_resource.additional_managers["prod-k3s-manager-2"]: Refreshing state... [id=7258359588995152786]
local_sensitive_file.kubeconfig: Refreshing state... [id=889aa9dd59e723366b9e6d3eb003379905c5ec70]
module.k3s.ssh_resource.drain_managers["prod-k3s-manager-2"]: Refreshing state... [id=2330492984286697223]
module.k3s.ssh_resource.drain_managers["prod-k3s-manager-1"]: Refreshing state... [id=5877134580244314390]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_sensitive_file.kubeconfig will be created
  + resource "local_sensitive_file" "kubeconfig" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "/github/workspace/.kubeconfig"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
time=2024-12-12T13:50:38Z level=info msg=Downloading Terraform configurations from file:///github/workspace/modules/kubernetes into /github/workspace/stacks/prod/kubernetes/.terragrunt-cache/-HGVTuUtXSFDQCN7IIesL6CulRY/z4vfL_CY3720zQ-fo9fFtb8YbxA prefix=[/github/workspace/stacks/prod/kubernetes] 
Initializing the backend...

Successfully configured the backend "remote"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing provider plugins...
- Reusing previous version of hashicorp/helm from the dependency lock file
- Reusing previous version of infisical/infisical from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Installing hashicorp/helm v2.14.1...
- Installed hashicorp/helm v2.14.1 (signed by HashiCorp)
- Installing infisical/infisical v0.12.4...
- Installed infisical/infisical v0.12.4 (self-signed, key ID 2513406FB39E8BB6)
- Installing hashicorp/kubernetes v2.31.0...
- Installed hashicorp/kubernetes v2.31.0 (signed by HashiCorp)
Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has been successfully initialized!
kubernetes_namespace_v1.external_secrets: Refreshing state... [id=external-secrets]
kubernetes_namespace_v1.metallb: Refreshing state... [id=metallb-system]
kubernetes_secret_v1.hcloud: Refreshing state... [id=kube-system/hcloud]
kubernetes_namespace_v1.argocd: Refreshing state... [id=argocd]
data.infisical_secrets.common_secrets: Reading...
data.infisical_secrets.common_secrets: Read complete after 0s
kubernetes_secret_v1.oidc_secret: Refreshing state... [id=argocd/oidc]
helm_release.hcloud_ccm: Refreshing state... [id=hccm]
helm_release.hcloud_csi: Refreshing state... [id=hcsi]
kubernetes_secret_v1.infisical: Refreshing state... [id=external-secrets/infisical]
helm_release.argocd: Refreshing state... [id=argocd]
data.kubernetes_nodes.cluster: Reading...
data.kubernetes_nodes.cluster: Read complete after 1s [id=9adb03d61c5bc50c4de9e7030aa70d66142615e9ec1928d228226d0d418d3245]
kubernetes_config_map_v1.metallb: Refreshing state... [id=metallb-system/nodes]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # kubernetes_namespace_v1.external_secrets will be updated in-place
  ~ resource "kubernetes_namespace_v1" "external_secrets" {
        id                               = "external-secrets"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ annotations      = {
              - "argocd.argoproj.io/sync-wave" = "-1" -> null
            }
          ~ labels           = {
              - "prometheus" = "enabled" -> null
            }
            name             = "external-secrets"
            # (4 unchanged attributes hidden)
        }
    }

  # kubernetes_namespace_v1.metallb will be updated in-place
  ~ resource "kubernetes_namespace_v1" "metallb" {
        id                               = "metallb-system"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ annotations      = {
              - "argocd.argoproj.io/sync-wave" = "-1" -> null
            }
          ~ labels           = {
              - "prometheus" = "enabled" -> null
            }
            name             = "metallb-system"
            # (4 unchanged attributes hidden)
        }
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>
    
